In [8]:
data = [['Alex', 10], ['Bob', 12], ['Clark', 13]]

In [9]:
data

[['Alex', 10], ['Bob', 12], ['Clark', 13]]

In [10]:
import pandas as pd

In [13]:
df = pd.DataFrame(data, columns=['Name', 'Age'], dtype=float)

In [14]:
df

    Name   Age
0   Alex  10.0
1    Bob  12.0
2  Clark  13.0

In [22]:
d = {'Name': ['ishi', 'Ayu'], 'hobby': ['football', 'music']}

In [23]:
d

{'Name': ['ishi', 'Ayu'], 'hobby': ['football', 'music']}

In [24]:
df2 = pd.DataFrame(d)

In [25]:
df2

   Name     hobby
0  ishi  football
1   Ayu     music

In [30]:
df2.iloc[:,1]

0    football
1       music
Name: hobby, dtype: object